{"dialog": [{"text": "The image mainly comprises of 60% mountain, with stone making up 30% of the image bottom up, and a pillar of rocks on the right side. There is a small pool of sea in the center. There are two large, cumulus clouds.", "user_type": "Teller", "turn_idx": 0, "email": "jkrausliang"}, {"text": "Do the mountains have peaks or do they go all the way to the top of the screen? Where are the clouds located? Are the rocks touching the right screen?", "user_type": "Drawer", "turn_idx": 0, "email": "ablydon"}, {"text": "The mountain has a slight peak on the left, becoming uniform across the image until halfway, where there are three huge, long peaks of rock. The mountain only goes up 50%, but the peaks go up 80%. One cloud is on the left side. The other cloud is located behind the peaks.", "user_type": "Teller", "turn_idx": 1, "email": "jkrausliang"}, {"text": "Are the peaks made of rock or of mountain? Is there still a pillar of rock on the right?", "user_type": "Drawer", "turn_idx": 1, "email": "ablydon"}, {"text": "The three peaks on the right are made of rock, while the small peak on the left is made of mountain. Aside from the three peaks, there is a pillar of rock in the foreground of the right side.", "user_type": "Teller", "turn_idx": 2, "email": "jkrausliang"}, {"text": "What is the weather like?", "user_type": "Drawer", "turn_idx": 2, "email": "ablydon"}, {"text": "The sky itself seems to be sunny, but the clouds take up a majority part of the sky. The light primarily hits on the rocks which are at the bottom of the image before the sea. The mountains start after the sea, encircling the sea.", "user_type": "Teller", "turn_idx": 3, "email": "jkrausliang"}, {"text": "How big is the pillar? Height and width? ", "user_type": "Drawer", "turn_idx": 3, "email": "ablydon"}, {"text": "The rocky, right side pillar takes up 20% of the middle, then becomes thinner as it reaches the right side of the image. It has a rectangular shape. In front of the pillar is mainly mountain which connects the image to the bottom rocks of the image.", "user_type": "Teller", "turn_idx": 4, "email": "jkrausliang"}, {"text": "Okay, got it!", "user_type": "Drawer", "turn_idx": 4, "email": "ablydon"}, {"text": "The clouds take up a lot more of the sky, touching the mountains and completely taking up the 85% of the sky space. The sea should be a small pool, and the mountains should be closer to the foreground of the image.", "user_type": "Teller", "turn_idx": 5, "email": "jkrausliang"}, {"text": "I tried to fix it as best I could, but the mountains still look farther away.", "user_type": "Drawer", "turn_idx": 5, "email": "ablydon"}, {"text": "That's okay - The mountain on the left connects with the rocks on the right. ", "user_type": "Teller", "turn_idx": 6, "email": "jkrausliang"}, {"text": "I think I fixed it.", "user_type": "Drawer", "turn_idx": 6, "email": "ablydon"}]}