{"dialog": [{"text": "The picture is divided into three parts - the top is filled with sky, the middle is filled with mountain, and the bottom is filled with grass.", "user_type": "Teller", "turn_idx": 0, "email": "lohnguyen"}, {"text": "How tall are the mountains?", "user_type": "Drawer", "turn_idx": 0, "email": "trachan"}, {"text": "The mountains cover the middle third of the image, peaking in the middle with mild slope toward both sides.", "user_type": "Teller", "turn_idx": 1, "email": "lohnguyen"}, {"text": "Is the mountain green or snowy?", "user_type": "Drawer", "turn_idx": 1, "email": "trachan"}, {"text": "It is quite snowy. There is a layer of clouds above the mountains, going all the way from left to right.", "user_type": "Teller", "turn_idx": 2, "email": "lohnguyen"}, {"text": "Is the sky cloudy or there is just a thin layer of cloud with a blue background?", "user_type": "Drawer", "turn_idx": 2, "email": "trachan"}, {"text": "From that thin layer, some chunks of clouds go up to about one fifth below the top of the image, shaping like mushrooms. There are three of those - in the middle, on the right half, and one right at the right edge.", "user_type": "Teller", "turn_idx": 3, "email": "lohnguyen"}, {"text": "Is the sky clear blue or pale blue?", "user_type": "Drawer", "turn_idx": 3, "email": "trachan"}, {"text": "The sky is clear blue. Above the grass, there are some stones that form a range, going from almost left to almost right.", "user_type": "Teller", "turn_idx": 4, "email": "lohnguyen"}, {"text": "What is the shape of the range? Does it go in a horizontally straight way or curvy?", "user_type": "Drawer", "turn_idx": 4, "email": "trachan"}, {"text": "It is quite flat with some jagged edges and some peaks. Also they gather mostly in the middle.", "user_type": "Teller", "turn_idx": 5, "email": "lohnguyen"}, {"text": "What is the color of the grass? Are they very green or pale green?", "user_type": "Drawer", "turn_idx": 5, "email": "trachan"}, {"text": "They are very green. Also, can you make the peak of the mountain much lower (the top of the mountain is most flat, it just curves up a little).", "user_type": "Teller", "turn_idx": 6, "email": "lohnguyen"}, {"text": "Is there any other features that I missed?", "user_type": "Drawer", "turn_idx": 6, "email": "trachan"}, {"text": "Nope. Looks great!", "user_type": "Teller", "turn_idx": 7, "email": "lohnguyen"}]}