{"dialog": [{"text": "Top half is cloud with a little sky showing on the left upper corner. The bottom half is split between sea and mountain with mountain on top and sea at the bottom. There are two hills sticking out at either side of the margin between where the mountain and sea meets.", "user_type": "Teller", "turn_idx": 0, "email": "zwa"}, {"text": "what is the shape of the mountain? is it cover with snow or grass? ", "user_type": "Drawer", "turn_idx": 0, "email": "jfung"}, {"text": "The mountain is mostly flat. There are snow at the top.", "user_type": "Teller", "turn_idx": 1, "email": "zwa"}, {"text": "is the mountain in the middle half of the image? is the sky blue?", "user_type": "Drawer", "turn_idx": 1, "email": "jfung"}, {"text": "Sky is blue. mountain is toward the lower half.", "user_type": "Teller", "turn_idx": 2, "email": "zwa"}, {"text": "is there any reflection of the water? ", "user_type": "Drawer", "turn_idx": 2, "email": "jfung"}, {"text": "No. From your perspective the water is like a river flowing inward toward the mountains around the hills. But if you just color the bottom as water it would be fine.", "user_type": "Teller", "turn_idx": 3, "email": "zwa"}, {"text": "so how is the water flows?", "user_type": "Drawer", "turn_idx": 3, "email": "jfung"}, {"text": "Well it's a still image so I'm not sure how to answer that. I took a peak and you need to make the water wider. The hills should distinguishable from the mountain.", "user_type": "Teller", "turn_idx": 4, "email": "zwa"}, {"text": "i am not sure how to draw the hills as you said. is there only one mountain or some mountains? how many peaks? ", "user_type": "Drawer", "turn_idx": 4, "email": "jfung"}, {"text": "It's an mountain range in the background. Hills are the the foreground. Then there's the water or river.", "user_type": "Teller", "turn_idx": 5, "email": "zwa"}, {"text": "is the river in the middle? how big is the hill?", "user_type": "Drawer", "turn_idx": 5, "email": "jfung"}, {"text": "The water is the lower one fourth of the image. The hills are small triangles.", "user_type": "Teller", "turn_idx": 6, "email": "zwa"}, {"text": "anything else?", "user_type": "Drawer", "turn_idx": 6, "email": "jfung"}]}