{"dialog": [{"text": "The top half of the image is sky and mountain. The mountain is like a triangle at the bottom of the top half and makes up about one-third of the top half. The mountains start off high at the left and slowly decrease in size(like a triangle).", "user_type": "Teller", "turn_idx": 0}, {"text": "Does the mountain go all the way to the right?", "user_type": "Drawer", "turn_idx": 0}, {"text": "Yes, but the mountains thin out at the right. ", "user_type": "Teller", "turn_idx": 1}, {"text": "Got it. Are there any clouds in the sky?", "user_type": "Drawer", "turn_idx": 1}, {"text": "There is a small circle of clouds(very small) on the right of the image slightly above the mountain. The cloud touches the right edge and makes a semi-circle. In the bottom half of the image, half of the left area is stone in a a crescent shape. The right half is water. ", "user_type": "Teller", "turn_idx": 2}, {"text": "Yes. Are the stones placed on any lands or are they scattered in the water?", "user_type": "Drawer", "turn_idx": 2}, {"text": "The stones are on land and act like the shoreline for the sea.(I said water instead of sea). On the left edge at the half-mark, there are trees that go on top of the mountains.", "user_type": "Teller", "turn_idx": 3}, {"text": "Are there a lot of trees there?", "user_type": "Drawer", "turn_idx": 3}, {"text": "Yes, it's very dense and it cuts the mountain off diagonally(not the whole thing). For the stone, make it rock(made a mistake). 1/3 way down from the creescent of the rock, there's erosion from the sea and creates an extra circle(like a bite) inside the crescent. ", "user_type": "Teller", "turn_idx": 4}, {"text": "Got it. What is the weather like?", "user_type": "Drawer", "turn_idx": 4}, {"text": "It's sunny. In the erosion area, there is small area of river on the top left. For the rocks, make sure the rock creates a crescent and then goes all the way to the right edge of the image. At the right edge, it is 1/4 above the bottom. ", "user_type": "Teller", "turn_idx": 5}, {"text": "Yes. Can you take a peek and tell me how it looks?", "user_type": "Drawer", "turn_idx": 5}, {"text": "The crescent part should be rock but a darker color, if that's possible. There is a small area of sky bordering the trees and the rock. It's very small in size and like an oval.", "user_type": "Teller", "turn_idx": 6}, {"text": "Got it. Is there any last detail for the image?", "user_type": "Drawer", "turn_idx": 6}, {"text": "The stones in the bottom of the image are at a greater elevation than the rest of the image. For the trees, they should be fall colors and the mountain is off to the distance so the greenery shouldn't be visible. ", "user_type": "Teller", "turn_idx": 7}, {"text": "I cannot really change the colors (of the mountains or trees) so I changed the weather a bit. I should we should be good.", "user_type": "Drawer", "turn_idx": 7}, {"text": "Ok, so finish game? ", "user_type": "Teller", "turn_idx": 8}]}