{"dialog": [{"text": "The picture is split in half. The bottom half is grass and the top half is sky. The grass slopes into a small hill on the right side.", "user_type": "Teller", "turn_idx": 0, "email": "jpwang"}, {"text": "Anything in the sky?", "user_type": "Drawer", "turn_idx": 0, "email": "wliu"}, {"text": "There are a few blobs of clouds near the grass, and thinner sheets of clouds near the top of the image.", "user_type": "Teller", "turn_idx": 1, "email": "jpwang"}, {"text": "Hows the grass? very green or kind of yellow", "user_type": "Drawer", "turn_idx": 1, "email": "wliu"}, {"text": "The grass is very green, and the hill is very smooth. The hill almost looks like a golf course. There are trees to the left of the hill.", "user_type": "Teller", "turn_idx": 2, "email": "jpwang"}, {"text": "how large is the group of trees", "user_type": "Drawer", "turn_idx": 2, "email": "wliu"}, {"text": "The bottom half of the screen is grass, trees and hills. Splitting that half into four squares, the bottom two is grass, the top right is hill, and the top left is trees. So the tops of the trees are slightly higher than the hill.", "user_type": "Teller", "turn_idx": 3, "email": "jpwang"}, {"text": "Can you describe more for the clouds , like the location, density, etc", "user_type": "Drawer", "turn_idx": 3, "email": "wliu"}, {"text": "There are three blobs of thick clouds at the bottom of the sky. One to the left, one in the center, and one to the right. There aren't any main clouds near the top of the screen; just small streaks of white.", "user_type": "Teller", "turn_idx": 4, "email": "jpwang"}, {"text": "Are there any more details that I need to know about?", "user_type": "Drawer", "turn_idx": 4, "email": "wliu"}, {"text": "Lastly, there are very small trees at the top of the hill that are a quarter smaller than the main trees to the left.", "user_type": "Teller", "turn_idx": 5, "email": "jpwang"}, {"text": "Do you mean the smaller trees at the left of the main trees?", "user_type": "Drawer", "turn_idx": 5, "email": "wliu"}, {"text": "The top of the hill on the right side of the screen has very short trees at the top of it that are a fourth of the height of the main trees to the left of the screen.", "user_type": "Teller", "turn_idx": 6, "email": "jpwang"}, {"text": "hows the light", "user_type": "Drawer", "turn_idx": 6, "email": "wliu"}, {"text": "You have the light correct. The grass should be completely green, and the trees to the left should be thicker and taller than the hill to the right.", "user_type": "Teller", "turn_idx": 7, "email": "jpwang"}, {"text": "Done", "user_type": "Drawer", "turn_idx": 7, "email": "wliu"}]}