{"dialog": [{"text": "You should first start with rock on the bottom half of the square", "user_type": "Teller", "turn_idx": 0, "email": "hoslee"}, {"text": "How long should the rock be ", "user_type": "Drawer", "turn_idx": 0, "email": "srbolotin"}, {"text": "It just covers the entire bottom half of the screen. In addition, the upper half of the square is sky. I'll fill you in on the finer details later.", "user_type": "Teller", "turn_idx": 1, "email": "hoslee"}, {"text": "what is the next step?", "user_type": "Drawer", "turn_idx": 1, "email": "srbolotin"}, {"text": "In the bottom half of the square, fill the upper right part with sea. It doesn't quite reach the very bottom of the square or the very left-side of the square. It covers around 60% of the bottom half of the square. ", "user_type": "Teller", "turn_idx": 2, "email": "hoslee"}, {"text": "So basically the right part of the rock minus some of the bottom and some of the left is going to be sea?", "user_type": "Drawer", "turn_idx": 2, "email": "srbolotin"}, {"text": "Yup, and the lower left part of the UPPER square should be a mountain range that declines as it goes from left to right. ", "user_type": "Teller", "turn_idx": 3, "email": "hoslee"}, {"text": "does the mountain attach to the rock or where is it sitting?", "user_type": "Drawer", "turn_idx": 3, "email": "srbolotin"}, {"text": "I peeked, in terms of shape, what you have is good. But the mountain extends all the way to the right of the screen until it is almost gone.", "user_type": "Teller", "turn_idx": 4, "email": "hoslee"}, {"text": "I think i got that, what is next? is there anything above the mountain?", "user_type": "Drawer", "turn_idx": 4, "email": "srbolotin"}, {"text": "No, but there is a tree formation at the wide part of the mountain. Its about as tall as the mountain, and it extends about 20% the width of the screen. It also has a declining pattern.", "user_type": "Teller", "turn_idx": 5, "email": "hoslee"}, {"text": "What do you mean by width of the screen and declining pattern?", "user_type": "Drawer", "turn_idx": 5, "email": "srbolotin"}, {"text": "Width of the square is what I meant and the declining pattern is basically that it starts out as tall as the mountains, but it shrinks to nothing as you move to the right (20% of the square width to the right)", "user_type": "Teller", "turn_idx": 6, "email": "hoslee"}, {"text": "i think i got that, what is the next step", "user_type": "Drawer", "turn_idx": 6, "email": "srbolotin"}, {"text": "I think you need to raise the lower bit of the rock a little more. There are other very fine details, but that is going to be the end.", "user_type": "Teller", "turn_idx": 7, "email": "hoslee"}, {"text": "The lower part as in underneath the water? and if that is the end are you ending the game?", "user_type": "Drawer", "turn_idx": 7, "email": "srbolotin"}, {"text": "So the strip of rock under the water, raise it a bit. That is right. Double the height of that strip of rock.", "user_type": "Teller", "turn_idx": 8, "email": "hoslee"}, {"text": "just fixed it thank you", "user_type": "Drawer", "turn_idx": 8, "email": "srbolotin"}]}