{"dialog": [{"text": "you should start with clouds covering most of the top third of the sky mainly on the left", "user_type": "Teller", "turn_idx": 0, "email": "srbolotin"}, {"text": "Do you see any mountains or water bodies like a lake?", "user_type": "Drawer", "turn_idx": 0, "email": "sspatil"}, {"text": "the middle third of the square is filled with mountains of varying height with the left most range descending from left to right but small and the a few more ranges in the middle across the page ", "user_type": "Teller", "turn_idx": 1, "email": "srbolotin"}, {"text": "Do you see any other type of landscape?", "user_type": "Drawer", "turn_idx": 1, "email": "sspatil"}, {"text": "Let's start the bottom third of the square with hill. Once you fill it there should be a small part of the left side filled with mountain that moves into the hill about halfway across the page. ", "user_type": "Teller", "turn_idx": 2, "email": "srbolotin"}, {"text": "What about the lighting?", "user_type": "Drawer", "turn_idx": 2, "email": "sspatil"}, {"text": "So i just peaked and make the clouds cover the entire top third. in addition the right 60% of the mountains will have snow caps. As for the ground, the bottom left 20% of the hills will have a few bushes. The lighting will be sunny and bright", "user_type": "Teller", "turn_idx": 3, "email": "srbolotin"}, {"text": "Anything else?", "user_type": "Drawer", "turn_idx": 3, "email": "sspatil"}, {"text": "There is sporadic grass on the right side of the hills on the top half and small patches as you go down to the bottom intertwined with some bush.", "user_type": "Teller", "turn_idx": 4, "email": "srbolotin"}, {"text": "Done", "user_type": "Drawer", "turn_idx": 4, "email": "sspatil"}, {"text": "Make the middle mountain range a bit pointier and the hills should be greener ", "user_type": "Teller", "turn_idx": 5, "email": "srbolotin"}, {"text": "Anything Else?", "user_type": "Drawer", "turn_idx": 5, "email": "sspatil"}, {"text": "That is it. I will end the game now ", "user_type": "Teller", "turn_idx": 6, "email": "srbolotin"}]}