{"dialog": [{"text": "Please draw the cloud fill the whole screen, and water starts from one fourth of the bottom to the middle and covers from left to right", "user_type": "Teller", "turn_idx": 0, "email": "yyxing"}, {"text": "Please elaborate on the water. I'm kind of confused at the description.", "user_type": "Drawer", "turn_idx": 0, "email": "hoslee"}, {"text": "Sorry, the water covers from left to right, it starts in the middle of the screen and is about a quarter of the screen wide", "user_type": "Teller", "turn_idx": 1, "email": "yyxing"}, {"text": "I think I got it. Is there any landmass in the image?", "user_type": "Drawer", "turn_idx": 1, "email": "hoslee"}, {"text": "Please draw very thin tree starting from the middle of the left side of the screen, about one third of the screen long", "user_type": "Teller", "turn_idx": 2, "email": "yyxing"}, {"text": "Are the trees the only grounded element? So far its mostly clouds and water", "user_type": "Drawer", "turn_idx": 2, "email": "hoslee"}, {"text": "there are clouds, mountain, river, sea, sky, tree and water in this picture, i will describe it one by one, sorry I should told you these in the beginning. The mountain starts in the middle of left side of the screen, and it is about half of the screen long from right", "user_type": "Teller", "turn_idx": 3, "email": "yyxing"}, {"text": "What do you see below the mountains?", "user_type": "Drawer", "turn_idx": 3, "email": "hoslee"}, {"text": "Below the mountain is the sea, please draw a rectangle as long as the mountain, one quarter of the screen height, and there is also a very thin sea from bottom right, about one eighth height", "user_type": "Teller", "turn_idx": 4, "email": "yyxing"}, {"text": "What is below the sea? On the left side", "user_type": "Drawer", "turn_idx": 4, "email": "hoslee"}, {"text": "Nothing, now we can move on the left side. please draw two streaks of the river on the water area, but do not cover all of them, also I just peaked your picture I can't see the mountain, maybe try to make it clear.", "user_type": "Teller", "turn_idx": 5, "email": "yyxing"}, {"text": "Does the mountain extend all the way to the right?", "user_type": "Drawer", "turn_idx": 5, "email": "hoslee"}, {"text": "The mountain starts from middle to the right", "user_type": "Teller", "turn_idx": 6, "email": "yyxing"}, {"text": "Are there any other key details?", "user_type": "Drawer", "turn_idx": 6, "email": "hoslee"}, {"text": "Please draw a very thin sky on the top of the screen, after that we should be good", "user_type": "Teller", "turn_idx": 7, "email": "yyxing"}, {"text": "How does it look? Do you have any peeks left?", "user_type": "Drawer", "turn_idx": 7, "email": "hoslee"}, {"text": "Please decrease the height of the mountain about two thirds, and there is trees on the middle left of the screen, slightly wider than the mountain", "user_type": "Teller", "turn_idx": 8, "email": "yyxing"}, {"text": "Done. But the mountain isn't very visible.", "user_type": "Drawer", "turn_idx": 8, "email": "hoslee"}]}