{"dialog": [{"text": "Top half clouds, bottom half sea. The sea is a little more than halfway up.", "user_type": "Teller", "turn_idx": 0, "email": "ablydon"}, {"text": "Is the horizon line fairly straight? What is the weather like?", "user_type": "Drawer", "turn_idx": 0, "email": "keloh"}, {"text": "Yes the horizon line is pretty much straight. The weather is cloudy overcast or stormy. There is also a rock about one third of the way up the sea and centered between right and left. ", "user_type": "Teller", "turn_idx": 1, "email": "ablydon"}, {"text": "How big is the rock and what is it shaped like?", "user_type": "Drawer", "turn_idx": 1, "email": "keloh"}, {"text": "The rock is small, kind of the size of a bean. It looks like it was an elliptical shape with the longer sides going left to right. It looks like it has some circles taken out of it around the edges to make it look oddly shaped.", "user_type": "Teller", "turn_idx": 2, "email": "ablydon"}, {"text": "Got it, is there anything else in the water?", "user_type": "Drawer", "turn_idx": 2, "email": "keloh"}, {"text": "There is a grass patch in the lower left corner. It goes a little less than halfway to the right and about a eighth of the way up.", "user_type": "Teller", "turn_idx": 3, "email": "ablydon"}, {"text": "Are there other details?", "user_type": "Drawer", "turn_idx": 3, "email": "keloh"}, {"text": "The rock should be flatter on the bottom and round on the top with a shelf on the right side.", "user_type": "Teller", "turn_idx": 4, "email": "ablydon"}, {"text": "Fixed it. What comes next?", "user_type": "Drawer", "turn_idx": 4, "email": "keloh"}, {"text": "The grass patch should be triangular and touching the left and bottom of the screen. ", "user_type": "Teller", "turn_idx": 5, "email": "ablydon"}, {"text": "Got it. Is there anything other than rock, grass, sea, and cloud?", "user_type": "Drawer", "turn_idx": 5, "email": "keloh"}, {"text": "The horizon should be straighter. The rock should be a bit smaller and the shelf on the right should be a bit wider and flatter. Also the grass patch should not go up as high. The image should be more bright but still with all the clouds.", "user_type": "Teller", "turn_idx": 6, "email": "ablydon"}, {"text": "Got it, I made those changes.", "user_type": "Drawer", "turn_idx": 6, "email": "keloh"}, {"text": "The picture should look very blue with bright colors, but still be cloudy.", "user_type": "Teller", "turn_idx": 7, "email": "ablydon"}, {"text": "I have done the best that I can with the weather options.", "user_type": "Drawer", "turn_idx": 7, "email": "keloh"}]}