{"dialog": [{"text": "40% of the image is water at the bottom. Where water meets landscape, there is snow, with three  trees on the right side of the image.  On the left side of the image, there are tall trees, which rise up to 80% of the image bottom to top. ", "user_type": "Teller", "turn_idx": 0, "email": "jkrausliang"}, {"text": "What is the landscape? Grass, mountains, etc.", "user_type": "Drawer", "turn_idx": 0, "email": "jpwang"}, {"text": "There isn't much landscape besides the snow. After the snow, the trees exist in the background, and behind those trees, there are two huge mountains on the left and right side of the image. In the middle of them there are trees further away.", "user_type": "Teller", "turn_idx": 1, "email": "jkrausliang"}, {"text": "Is there anything on the mountains?", "user_type": "Drawer", "turn_idx": 1, "email": "jpwang"}, {"text": "there is a bit of cloud above the trees. the mountains should have snow on top. there is one mountain on the left, and one mountain on the right sides of the image. they are not next to each other.  there are trees between them.", "user_type": "Teller", "turn_idx": 2, "email": "jkrausliang"}, {"text": "So going from left to right, it goes mountain, trees, mountain, trees?", "user_type": "Drawer", "turn_idx": 2, "email": "jpwang"}, {"text": "in the background, it goes mountain, trees, mountain. in the front of the right mountain, there are a few trees which sit on a bed of snow. there are also a bunch of dense trees in front of the left mountain, which also sits on snow.", "user_type": "Teller", "turn_idx": 3, "email": "jkrausliang"}, {"text": "How tall are the mountains?", "user_type": "Drawer", "turn_idx": 3, "email": "jpwang"}, {"text": "the left mountain takes up most of the image with a bit of sky left.  it slowly descends downward a bit as it reaches the center part of the image, ending with a huge, instant decline down - very rectangular.  the right mountain takes up only about 60% of the sky space.", "user_type": "Teller", "turn_idx": 4, "email": "jkrausliang"}, {"text": "Anything else?", "user_type": "Drawer", "turn_idx": 4, "email": "jpwang"}]}