{"dialog": [{"text": "The top half is sky and the bottom half is water, with one small area of river at the far left near the bottom and another near the middle of the top of the water.", "user_type": "Teller", "turn_idx": 0, "email": "keloh"}, {"text": "Yes. What is the weather like?", "user_type": "Drawer", "turn_idx": 0, "email": "lohnguyen"}, {"text": "The weather is somewhat hazy - you cannot see the sun. In the middle of the image, there is a line of trees that extends from the far left almost until the right, but not touching the right side.", "user_type": "Teller", "turn_idx": 1, "email": "keloh"}, {"text": "How tall are the trees? Are they flat on the top?", "user_type": "Drawer", "turn_idx": 1, "email": "lohnguyen"}, {"text": "On the left side, the trees reach from one quarter of the length from the top to one third of the way from the bottom. The right side is about half of this height and the slope is fairly even, but has a slightly jagged edge", "user_type": "Teller", "turn_idx": 2, "email": "keloh"}, {"text": "Yes. Is there any cloud in the sky?", "user_type": "Drawer", "turn_idx": 2, "email": "lohnguyen"}, {"text": "There is a thin layer of clouds above the trees in the middle of the image. There are mountains on each side of these clouds.", "user_type": "Teller", "turn_idx": 3, "email": "keloh"}, {"text": "How tall are the mountains?", "user_type": "Drawer", "turn_idx": 3, "email": "lohnguyen"}, {"text": "The top of the mountain at the left is halfway between the top of the trees and the top of the image. The mountains at the right are the same height and both slope down to the clouds in the middle. The one on the right has a steeper slope.", "user_type": "Teller", "turn_idx": 4, "email": "keloh"}, {"text": "Very clear instructions! Can you take a peek and see how it looks?", "user_type": "Drawer", "turn_idx": 4, "email": "lohnguyen"}, {"text": "Its very close! Can you move the cloud a bit to the right and have the height of the trees decrease more slowly from the left? The downwards slope should curve a bit - imagine this symbol ( with the open side facing up", "user_type": "Teller", "turn_idx": 5, "email": "keloh"}, {"text": "Got it. Any last details?", "user_type": "Drawer", "turn_idx": 5, "email": "lohnguyen"}, {"text": "The clouds should be lower and if you can, could you make the weather look more blue?", "user_type": "Teller", "turn_idx": 6, "email": "keloh"}, {"text": "Got it. We should be good!", "user_type": "Drawer", "turn_idx": 6, "email": "lohnguyen"}]}