{"dialog": [{"text": "The top half of the image is clouds and the bottom is rather complex, but start by filling it with water", "user_type": "Teller", "turn_idx": 0, "email": "keloh"}, {"text": "Alright you can start describing the bottom half now", "user_type": "Drawer", "turn_idx": 0, "email": "hoslee"}, {"text": "The right third of the bottom half is mostly sea. After you do that, put clouds (this is a reflection) in the bottom half of the area of water. Let the sea peek out in the bottom right corner.", "user_type": "Teller", "turn_idx": 1, "email": "keloh"}, {"text": "I think I did it, but there was no big change visually, is there any grounded material?", "user_type": "Drawer", "turn_idx": 1, "email": "hoslee"}, {"text": "There is a thin horizontal line of mountain above the water on the right side. It extends until about the middle of the image. On the left, there are some trees that are slightly taller than the mountain and they extend to one third of the way from the left.", "user_type": "Teller", "turn_idx": 2, "email": "keloh"}, {"text": "Alright, are there any other details?", "user_type": "Drawer", "turn_idx": 2, "email": "hoslee"}, {"text": "Yes, a thin line of sky along the top edge. Then add two horizontal lines of river within the water. The first one sits above the cloud reflection and goes from the far left until it meets the sea. The second one is above the first and does not quite reach the sea.", "user_type": "Teller", "turn_idx": 3, "email": "keloh"}, {"text": "That didn't change the image visually that much, how does it look?", "user_type": "Drawer", "turn_idx": 3, "email": "hoslee"}, {"text": "Its looking great! Can you move the horizon line up closer to the halfway point?", "user_type": "Teller", "turn_idx": 4, "email": "keloh"}, {"text": "Alright I moved it up. There are no additional major details right?", "user_type": "Drawer", "turn_idx": 4, "email": "hoslee"}, {"text": "Right, no other major details. Maybe have the mountains end a little bit sooner? They should be thinner at the middle.", "user_type": "Teller", "turn_idx": 5, "email": "keloh"}, {"text": "Alright I shaved the mountains at its left end, if that is what you meant", "user_type": "Drawer", "turn_idx": 5, "email": "hoslee"}, {"text": "Great, thanks! I cant peek anymore but if you could move the horizon up a tiny bit more, that should be the last thing", "user_type": "Teller", "turn_idx": 6, "email": "keloh"}, {"text": "Alright I moved up the horizon and shifted the mountain and the trees accordingly.", "user_type": "Drawer", "turn_idx": 6, "email": "hoslee"}]}