{"dialog": [{"text": "The image is a coastline. There is mountain sloping up from the right edge of the image, very gently, to the left edge. Below the mountain there is a sea and stone", "user_type": "Teller", "turn_idx": 0, "email": "trachan"}, {"text": "How much stone is there? Do the mountains take up the majority of the screen?", "user_type": "Drawer", "turn_idx": 0, "email": "jpwang"}, {"text": "The mountain don't take up a majority of the screen. Instead the sky takes up the upper third of the screen. The mountain is far away from us. It only occupies one sixth of the screen, gently sloping upwards from the right to left.  ", "user_type": "Teller", "turn_idx": 1, "email": "trachan"}, {"text": "Are there any trees or flowers on the mountains?", "user_type": "Drawer", "turn_idx": 1, "email": "jpwang"}, {"text": "The mountain is snowy, they are far away so they are not the main subject of the image. Imagine the photographer sitting on the stone next to the coastline, the stone occupies the bottom left and bottom margin of the image. ", "user_type": "Teller", "turn_idx": 2, "email": "trachan"}, {"text": "Are there clouds in the sky?", "user_type": "Drawer", "turn_idx": 2, "email": "jpwang"}, {"text": "No there are no clouds. It is completely blue. For the sea, it only touches the right edge of the screen, the stone should touch the bottom and left edge, and imagine there is a coastline curving outwards", "user_type": "Teller", "turn_idx": 3, "email": "trachan"}, {"text": "Are there any rocks in the sea aside from the stone?", "user_type": "Drawer", "turn_idx": 3, "email": "jpwang"}, {"text": "No there are insignificant rocks. You have the correct coastline direction. There is also a tree at the left middle edge of the screen. The tree is not tall, it should be just touching the mountain at the left edge. Good job", "user_type": "Teller", "turn_idx": 4, "email": "trachan"}, {"text": "Thank you. Is there anything else in the frame?", "user_type": "Drawer", "turn_idx": 4, "email": "jpwang"}, {"text": "The tree should touch the left edge of the image, taking up some of the stone. Other than that, can you try your best to get rid of the stone in the middle of the sea", "user_type": "Teller", "turn_idx": 5, "email": "trachan"}, {"text": "Where does the base of the tree start? On the mountains or on the stone?", "user_type": "Drawer", "turn_idx": 5, "email": "jpwang"}, {"text": "The base of the tree is out of the image, should be even left. There are only branches and leaves showing on the image, occupying about a quarter of height and never reach the sea. Also the stone is darker", "user_type": "Teller", "turn_idx": 6, "email": "trachan"}, {"text": "Is there anything else in the frame?", "user_type": "Drawer", "turn_idx": 6, "email": "jpwang"}, {"text": "I think it's ready", "user_type": "Teller", "turn_idx": 7, "email": "trachan"}]}