{"dialog": [{"text": "The bottom half is a river", "user_type": "Teller", "turn_idx": 0, "email": "lucrod"}, {"text": "is there any grass or anything around the river?", "user_type": "Drawer", "turn_idx": 0, "email": "ablydon"}, {"text": "There is a small strip of grass and trees directly above the river. It is a little wider on the right two thirds of the picture", "user_type": "Teller", "turn_idx": 1, "email": "lucrod"}, {"text": "is there any thing in the sky or in the river? Are there any mountains?", "user_type": "Drawer", "turn_idx": 1, "email": "ablydon"}, {"text": "There is nothing in the river. There is mountains above the river that go up about halfway into the sky", "user_type": "Teller", "turn_idx": 2, "email": "lucrod"}, {"text": "How many peaks do they have? Are they steep or level?", "user_type": "Drawer", "turn_idx": 2, "email": "ablydon"}, {"text": "The mountains are level all the way across, however it is a little bit taller on the left side. There is also a peak at the middle of the mountain.", "user_type": "Teller", "turn_idx": 3, "email": "lucrod"}, {"text": "How tall is the peak? Is there anything else?", "user_type": "Drawer", "turn_idx": 3, "email": "ablydon"}, {"text": "The peak is not much taller than the rest of the mountain, however it is jagged. There is also a dip in the mountain halfway towards the left from the center", "user_type": "Teller", "turn_idx": 4, "email": "lucrod"}, {"text": "how deep is the dip in the mountain? is the mountain flat on the right side?", "user_type": "Drawer", "turn_idx": 4, "email": "ablydon"}, {"text": "The dip goes a little less than halfway into the mountain. The rest of the mountain is a little jagged, but does not deviate much in terms of height", "user_type": "Teller", "turn_idx": 5, "email": "lucrod"}, {"text": "Are the peaks in the middle more jagged than the rest of the mountain? How many jagged pieces in the peak?", "user_type": "Drawer", "turn_idx": 5, "email": "ablydon"}, {"text": "There are two jagged pieces in the peak. The rest of the mountain has very small jagged edges throughout", "user_type": "Teller", "turn_idx": 6, "email": "lucrod"}, {"text": "How high do the jagged pieces on the peak go? ", "user_type": "Drawer", "turn_idx": 6, "email": "ablydon"}, {"text": "They do not go high up at all. They are only high enough to be distinguishable.", "user_type": "Teller", "turn_idx": 7, "email": "lucrod"}, {"text": "Okay. what is the weather like? And is there anything else? I feel like I put everything in.", "user_type": "Drawer", "turn_idx": 7, "email": "ablydon"}, {"text": "There are no clouds. The strip of trees is very narrow and is directly above a narrow strip of grass. It ends just before it hits the left side of the picture.", "user_type": "Teller", "turn_idx": 8, "email": "lucrod"}, {"text": "Okay. I tried to decrease the thickness on my drawing, but it looks like there are still a lot of trees. Is there anything else? ", "user_type": "Drawer", "turn_idx": 8, "email": "ablydon"}, {"text": "No there's nothing else", "user_type": "Teller", "turn_idx": 9, "email": "lucrod"}]}