{"dialog": [{"text": "The top half is clouds and the bottom half is grass..", "user_type": "Teller", "turn_idx": 0, "email": "keloh"}, {"text": "How dense are the clouds, and are there any plants on the grass?", "user_type": "Drawer", "turn_idx": 0, "email": "jpwang"}, {"text": "The clouds are quite dense, they fill the whole top of the image. There is a row of trees above the grass that extend all the way from left to right", "user_type": "Teller", "turn_idx": 1, "email": "keloh"}, {"text": "How tall are the trees?", "user_type": "Drawer", "turn_idx": 1, "email": "jpwang"}, {"text": "At the left, the trees are rather short. They get slightly taller as you go right. The overall height on the right side is equal to about one fifth of the height of the image.", "user_type": "Teller", "turn_idx": 2, "email": "keloh"}, {"text": "Are there any plants on the grass?", "user_type": "Drawer", "turn_idx": 2, "email": "jpwang"}, {"text": "Not within the grass, no. Just the trees on top. There is a river that goes from the bottom left corner to the far right side, about a third of the way up", "user_type": "Teller", "turn_idx": 3, "email": "keloh"}, {"text": "How wide is the river?", "user_type": "Drawer", "turn_idx": 3, "email": "jpwang"}, {"text": "The river is fairly thin and it slopes upward from left to right, so you should still see a triangle of grass beneath it in the bottom right corner. Within this triangle, please add bushes, but leave a few very small patches of grass showing", "user_type": "Teller", "turn_idx": 4, "email": "keloh"}, {"text": "Is there anything else I should know about?", "user_type": "Drawer", "turn_idx": 4, "email": "jpwang"}, {"text": "Those are all the main details and your drawing looks good so far! Can you decrease the slope of the river though? It should not go so high on the right side.", "user_type": "Teller", "turn_idx": 5, "email": "keloh"}, {"text": "Thank you. Done.", "user_type": "Drawer", "turn_idx": 5, "email": "jpwang"}, {"text": "Great, last thing is could you make the river thicker at the bottom left corner? The width at the top right of your river is good and it should be the same for the whole thing", "user_type": "Teller", "turn_idx": 6, "email": "keloh"}, {"text": "Got it. Anything else?", "user_type": "Drawer", "turn_idx": 6, "email": "jpwang"}]}