{"dialog": [{"text": "The bottom half of the picture is grass and the top half is all sky.", "user_type": "Teller", "turn_idx": 0, "email": "lohnguyen"}, {"text": "Got it, is the horizon line flat?", "user_type": "Drawer", "turn_idx": 0, "email": "keloh"}, {"text": "It is flat on the right but slowly curves down starting at one fourth from the right and going down all the way to the left.", "user_type": "Teller", "turn_idx": 1, "email": "lohnguyen"}, {"text": "How steep is the slope? How high does the grass reach at the left edge of the image?", "user_type": "Drawer", "turn_idx": 1, "email": "keloh"}, {"text": "The slope is not very steep - it slowly curves down and at the left edge, it is about one fifth below the middle.", "user_type": "Teller", "turn_idx": 2, "email": "lohnguyen"}, {"text": "Okay, what is the weather like?", "user_type": "Drawer", "turn_idx": 2, "email": "keloh"}, {"text": "The weather is clear. There is a thin layer of cloud right above the trees, going all the way from left to right.", "user_type": "Teller", "turn_idx": 3, "email": "lohnguyen"}, {"text": "Can you tell me about the trees? Do they go all the way across the image? How tall are they?", "user_type": "Drawer", "turn_idx": 3, "email": "keloh"}, {"text": "The trees go all across the image, filling the gap between the grass (curving down) on the left. They get thinner after four fifths of the way from the left and end up just a bit above the grass on the right.", "user_type": "Teller", "turn_idx": 4, "email": "lohnguyen"}, {"text": "Are the tops of the trees fairly flat?", "user_type": "Drawer", "turn_idx": 4, "email": "keloh"}, {"text": "The tops curve up mildly from left to right and then goes down and then flat at about one fifth from the right edge.", "user_type": "Teller", "turn_idx": 5, "email": "lohnguyen"}, {"text": "Is this curve in the same direction as the grass?", "user_type": "Drawer", "turn_idx": 5, "email": "keloh"}, {"text": "Yes, but the grass curves down toward the left and the trees curve up and then down from the left.", "user_type": "Teller", "turn_idx": 6, "email": "lohnguyen"}, {"text": "Can you peek to see if its going in the right direction?", "user_type": "Drawer", "turn_idx": 6, "email": "keloh"}, {"text": "Wow, that is perfect! Can you put the layer of cloud above the trees, from left to right (higher on the right to fill up the gap). The slope of the trees should come later (one fifth from the right edge).", "user_type": "Teller", "turn_idx": 7, "email": "lohnguyen"}, {"text": "Got it! Is there anything else?", "user_type": "Drawer", "turn_idx": 7, "email": "keloh"}, {"text": "Nope. Looks great!", "user_type": "Teller", "turn_idx": 8, "email": "lohnguyen"}]}