{"dialog": [{"text": "Fill the bottom half with grass and the upper half with clouds.", "user_type": "Teller", "turn_idx": 0, "email": "hoslee"}, {"text": "Done. Are there any trees, hills, or other landscape? Is the sky completely overcast?", "user_type": "Drawer", "turn_idx": 0, "email": "jkrausliang"}, {"text": "Yes the sky is completely overcast. But there is a treeline eating into the bottom part of the cloud formation. The treeline is especially thick on the right and it even eats into the grass.  ", "user_type": "Teller", "turn_idx": 1, "email": "hoslee"}, {"text": "Okay, how tall are the trees - what portion of the image does it take up? Is there anything notable in the landscape of the grass?", "user_type": "Drawer", "turn_idx": 1, "email": "jkrausliang"}, {"text": "Alright so I took a peek at your image, the right part of the tree formation should eat a little bit into the grass. Also the right most part of the tree formation looks a little too high. ", "user_type": "Teller", "turn_idx": 2, "email": "hoslee"}, {"text": "okay - anything else?", "user_type": "Drawer", "turn_idx": 2, "email": "jkrausliang"}, {"text": "Now you are going to draw a river. The river should start at the bottom left corner and extend all the way to the right (approximate ending at the midpoint of the grass formation).", "user_type": "Teller", "turn_idx": 3, "email": "hoslee"}, {"text": "how thick is the river? ", "user_type": "Drawer", "turn_idx": 3, "email": "jkrausliang"}, {"text": "On the very left side, it takes up about a quarter of the grass height. On the very right side, it is very skinny (about half that thickness). Replace the grass below the river with bush. ", "user_type": "Teller", "turn_idx": 4, "email": "hoslee"}, {"text": "Okay. What is the lighting like?", "user_type": "Drawer", "turn_idx": 4, "email": "jkrausliang"}, {"text": "Lighting is fine. Raise the level of the grass and we are done", "user_type": "Teller", "turn_idx": 5, "email": "hoslee"}, {"text": "done", "user_type": "Drawer", "turn_idx": 5, "email": "jkrausliang"}]}